app/views/courses/index.html.haml


  - @user.courses.each do |course|
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = ?  [["user_id", 1]]