app/controllers/courses_controller.rb

  def create
    # @course = @user.courses.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "grade", "level", "credit", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "AP Physics C"], ["grade", "A+"], ["level", "AP"], ["credit", 1.0], ["user_id", 1], ["created_at", "2015-09-05 20:39:08.953749"], ["updated_at", "2015-09-05 20:39:08.953749"]]

  def update
    # @course = @user.courses.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])
---
UPDATE "courses" SET "name" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["name", "AP Calculus BCD"], ["updated_at", "2015-09-05 20:44:45.712816"], ["id", 2]]

  def set_user
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]